#include <iostream>

using namespace std;
int main()
{   
    setlocale(LC_ALL, "rus");
    int h1, m1, h2, m2; char a, b;
    cout << "Введите время прихода 1-го человека: "; cin >> h1 >> a >> m1;
    cout << "Введите время прихода 2-го человека: "; cin >> h2 >> b >> m2;
    if (h1 - h2 == 1)
    {
        if (((m1 + 60) - m2) <= 15)
        {
            cout << "\nВстреча состоится!";
        }
        else if (((m1 + 60) - m2) > 15)
        {
            cout << "\nВстреча не состоится!";
        }
    }
    if (h2 - h1 == 1)
    {
        if (((m2 + 60) - m1) <= 15)
        {
            cout << "\nВстреча состоится!";
        }
        else if (((m2 + 60) - m1) > 15)
        {
            cout << "\nВстреча не состоится!";
        }
    }
    if (h1 == 23 && h2 == 0)
    {
        if (((m2 + 60) - m1) <= 15)
        {
            cout << "\nВстреча состоится!";
        }
        else if (((m2 + 60) - m1) > 15)
        {
            cout << "\nВстреча не состоится!";
        }
    }
    if (h2 == 23 && h1 == 0)
    {
        if (((m1 + 60) - m2) <= 15)
        {
            cout << "\nВстреча состоится!";
        }
        else if (((m1 + 60) - m2) > 15)
        {
            cout << "\nВстреча не состоится!";
        }
    }
    if ((h1 - h2 > 2 && h1 - h2 != 23) || (h2 - h1 > 2 && h2 - h1 != 23))
    {
        cout << "\nВстерча не состоится!";
    }
}