#include <iostream>

using namespace std;
int main()
{
    //Задание №1. 
    //Напишите программу, отображающую в консоль следующее сообщение: "Результат выражения 2+2*2 = " и в этой же строке выведите ответ.

    setlocale(LC_ALL, "rus");
    cout << "Задание №1\n\n";
    cout << "Результат выражения 2 + 2 * 2 = " << 2 + 2 * 2 << "\n\n";
}

